cask_args appdir: '/Applications'

brew 'pyenv'
brew 'llvm'
brew 'zsh'
brew 'git'
brew 'tig'
brew 'the_silver_searcher'
brew 'fzf'
brew 'mysql'
brew 'redis'
brew 'ripgrep'
brew 'rbenv'
brew 'ruby-build'
brew 'pyenv'
brew 'node'
brew 'mas'
brew 'go'
brew 'shared-mime-info'

tap 'neovim/neovim'
brew 'neovim'

cask 'zoom'
cask 'visual-studio-code'
cask 'spotify'
cask 'goland'
cask 'datagrip'
cask 'orbstack'
cask 'raycast'
cask 'zen'
cask 'ghostty'
cask 'viscosity'
cask 'chatgpt'
cask 'slack'
cask 'postgres-app'
cask '1password'
cask 'codex'
cask 'telegram'

tap 'homebrew/cask-fonts'
cask 'font-jetbrains-mono-nerd-font'
