cask_args appdir: '/Applications'

brew 'pyenv'
brew 'llvm'
brew 'zsh'
brew 'git'
brew 'the_silver_searcher'
brew 'fzf'
brew 'mysql'
brew 'postgres'
brew 'redis'
brew 'ripgrep'
brew 'rbenv'
brew 'ruby-build'
brew 'pyenv'
brew 'node'

tap 'neovim/neovim'
brew 'neovim'

cask 'slack'
cask 'tiles'
cask 'brave'
cask 'google-chrome'
cask 'postgres'
cask '1password'
cask 'alfred'
cask 'viscosity'
cask 'hipchat'
cask 'cleanmymac'
cask 'atom'
cask 'cyberduck'
cask 'spotify'
cask 'spotify-notifications'
cask 'iterm2'
cask 'docker'

tap 'homebrew/cask-fonts'
cask 'font-jetbrains-mono-nerd-font'
