cask_args appdir: '/Applications'

brew 'python3'
brew 'zsh'
brew 'git'
brew 'the_silver_searcher'
brew 'fzf'
brew 'mysql'
brew 'redis'
brew 'ripgrep'
brew 'rbenv'
brew 'ruby-build'
brew 'pyenv'
brew 'node'
brew 'mas'
brew 'go'

tap 'neovim/neovim'
brew 'neovim'

cask 'zoom'
cask 'brave'
cask 'postgres'
cask 'raycast'
cask 'viscosity'
cask 'slack'
cask 'visual-studio-code'
cask 'cyberduck'
cask 'spotify'
cask 'spotify-notifications'
cask 'iterm2'
cask 'finch'
cask 'goland'
cask 'datagrip'

tap 'homebrew/cask-fonts'
cask 'font-jetbrains-mono-nerd-font'
